OpenFOAM-v2412/tutorials/lagrangian/MPPICFoam/cyclone/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

[ -d constant/triSurface ] || mkdir -p constant/triSurface

cp -f "$FOAM_TUTORIALS"/resources/geometry/cyclone.stl.gz constant/triSurface

restore0Dir

runApplication blockMesh

runApplication snappyHexMesh -overwrite

runApplication decomposePar

runParallel $(getApplication)

#------------------------------------------------------------------------------
